Revit 2026 API

# RebarShapeDefinitionByArcAddConstraintSagittaLength Method

---

Specify a parameter to drive the sagittal length (the height of the circular segment, measured perpendicular to the chord).

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddConstraintSagittaLength(
	ElementId paramId
)
```
```vb
Public Sub AddConstraintSagittaLength (
	paramId As ElementId
)
```
```cpp
public:
void AddConstraintSagittaLength(
	ElementId^ paramId
)
```
```fsharp
member AddConstraintSagittaLength :
        paramId : ElementId -> unit
```

#### Parameters

paramId ElementId
     Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The sagitta will be measured on the centerline of the bar.

#### Reference

RebarShapeDefinitionByArc Class

Autodesk.Revit.DB.Structure Namespace